In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [2]:
country_dict = {
    'US': pd.read_csv('vacationUS.csv'),
    'UK': pd.read_csv('vacationUK.csv'),
    'PL': pd.read_csv('vacationPL.csv')
}

In [3]:
country_dict['US'].head()

     Month  vacation: (United States)
0  2004-01                         98
1  2004-02                         89
2  2004-03                         80
3  2004-04                         78
4  2004-05                         85

In [4]:
for dataframe in country_dict.values():
    dataframe.set_index('Month', inplace=True)

country_dict['US'].head()

         vacation: (United States)
Month
2004-01                         98
2004-02                         89
2004-03                         80
2004-04                         78
2004-05                         85

In [5]:
for country_code, country_name in zip(['PL', 'UK', 'US'], ['Poland', 'United Kingdom', 'United States']):
    country_dict[country_code].rename(columns={f'vacation: ({country_name})': country_code}, inplace=True)

country_dict['US'].head()

         US
Month
2004-01  98
2004-02  89
2004-03  80
2004-04  78
2004-05  85

In [6]:
country_dict['UK'].head()

         UK
Month
2004-01  41
2004-02  38
2004-03  43
2004-04  36
2004-05  38

In [7]:
country_dict['PL'].head()

          PL
Month
2004-01    0
2004-02  100
2004-03    0
2004-04    0
2004-05    0

In [9]:
country_df = pd.concat([country_dict[code] for code in country_dict.keys()])
country_df.head()

           US  UK  PL
Month
2004-01  98.0 NaN NaN
2004-02  89.0 NaN NaN
2004-03  80.0 NaN NaN
2004-04  78.0 NaN NaN
2004-05  85.0 NaN NaN